{
  "activation": "gelu",
  "architectures": [
    "DistilBertForSequenceClassification"
  ],
  "attention_dropout": 0.1,
  "dim": 768,
  "dropout": 0.1,
  "dtype": "float32",
  "hidden_dim": 3072,
  "id2label": {
    "0": "mean",
    "1": "median",
    "2": "mode",
    "3": "stats",
    "4": "trend",
    "5": "volatility",
    "6": "forecast",
    "7": "year"
  },
  "initializer_range": 0.02,
  "label2id": {
    "forecast": 6,
    "mean": 0,
    "median": 1,
    "mode": 2,
    "stats": 3,
    "trend": 4,
    "volatility": 5,
    "year": 7
  },
  "max_position_embeddings": 512,
  "model_type": "distilbert",
  "n_heads": 12,
  "n_layers": 6,
  "pad_token_id": 0,
  "problem_type": "single_label_classification",
  "qa_dropout": 0.1,
  "seq_classif_dropout": 0.2,
  "sinusoidal_pos_embds": false,
  "tie_weights_": true,
  "transformers_version": "4.57.3",
  "vocab_size": 30522
}
